posts/2012-09-13-Kindle-app-does-not-start.org
#+title: Kindle.app not starting on a case-sensitive file system
#+date: <2012-09-13 20:19>
#+tags: computers

So Kindle.app was updated through the App Store and did not start any more. It just crashed and the crash reporter came up.

A quick look at Console.app turns up a link to the actual crash report. And the crash report starts with

#+begin_src
    Dyld Error Message:
      Library not loaded: @executable_path/../Frameworks/libWEbCoreKRF.dylib
      Referenced from: /Applications/Kindle.app/Contents/Frameworks/libWebCoreViewer.dylib
      Reason: image not found
#+end_src

~libWEbCoreKRF.dylib~? With a capitalized ~E~? That looks very much like a spelling error. So, point your terminal to ~/Applications/Kindle.app/Contents/Frameworks/~, type

#+begin_src sh
    sudo ln -s libWebCoreKRF.dylib libWEbCoreKRF.dylib
#+end_src

to create a symlink with the misspelled name. Done.

Kindle works again.

Spelling is hard, it seems.
