2012-09-13-Kindle-app-does-not-start.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>Kindle.app not starting on a case-sensitive file system</title>
<!-- 2013-11-12 Tue 16:39 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="Bastian Bechtold" />
<link rel="alternate" type="appliation/rss+xml"
                href="http://bastibe.de/rss.xml"
                title="RSS feed for bastibe.de">
          <link href='http://fonts.googleapis.com/css?family=Roboto&subset=latin' rel='stylesheet' type='text/css'>
          <link href='http://fonts.googleapis.com/css?family=Ubuntu+Mono' rel='stylesheet' type='text/css'>
          <link href= "static/style.css" rel="stylesheet" type="text/css" />
          <title>Basti's Scratchpad on the Internet</title>
          <meta http-equiv="content-type" content="application/xhtml+xml; charset=UTF-8" />
          <meta name="viewport" content="initial-scale=1,width=device-width,minimum-scale=1">
</head>
<body>
<div id="preamble" class="status">
<div class="header">
              <a href="http://bastibe.de">Basti's Scratchpad on the Internet</a>
              <div class="sitelinks">
                  <a href="http://alpha.app.net/bastibe">alpha.app.net</a>  | <a href="http://github.com/bastibe">Github</a>
              </div>
          </div>
</div>
<div id="content">
<h1 class="title">Kindle.app not starting on a case-sensitive file system</h1>
<p>
So Kindle.app was updated through the App Store and did not start any more. It just crashed and the crash reporter came up.
</p>

<p>
A quick look at Console.app turns up a link to the actual crash report. And the crash report starts with
</p>

<pre class="example">
Dyld Error Message:
  Library not loaded: @executable_path/../Frameworks/libWEbCoreKRF.dylib
  Referenced from: /Applications/Kindle.app/Contents/Frameworks/libWebCoreViewer.dylib
  Reason: image not found
</pre>

<p>
<code>libWEbCoreKRF.dylib</code>? With a capitalized <code>E</code>? That looks very much like a spelling error. So, point your terminal to <code>/Applications/Kindle.app/Contents/Frameworks/</code>, type
</p>

<div class="org-src-container">

<pre class="src src-sh">sudo ln -s libWebCoreKRF.dylib libWEbCoreKRF.dylib
</pre>
</div>

<p>
to create a symlink with the misspelled name. Done.
</p>

<p>
Kindle works again.
</p>

<p>
Spelling is hard, it seems.
</p>
</div>
<div id="postamble" class="status">
<div id="archive"><a href="archive.html">Other posts</a></div>
              <div id="disqus_thread"></div>
              <script type="text/javascript">
              /* * * CONFIGURATION VARIABLES: EDIT BEFORE PASTING INTO YOUR WEBPAGE * * */
              var disqus_shortname = 'bastibe';
              /* * * DON'T EDIT BELOW THIS LINE * * */
              (function() {
                var dsq = document.createElement('script');
                dsq.type = 'text/javascript';
                dsq.async = true;
                dsq.src = 'http://' + disqus_shortname + '.disqus.com/embed.js';
                (document.getElementsByTagName('head')[0] || document.getElementsByTagName('body')[0]).appendChild(dsq);
                  })();
              </script>
              <noscript>Please enable JavaScript to view the
                  <a href="http://disqus.com/?ref_noscript">comments powered by Disqus.</a></noscript>
              <a href="http://disqus.com" class="dsq-brlink">comments powered by <span class="logo-disqus">Disqus</span></a>
</div>
</body>
</html>
